Andydingbing/SPC5/rd/chip/reg_def_sp9500x.h
#ifndef REG_DEF_SP9500X_H
#define REG_DEF_SP9500X_H

#include "reg_def.h"

#define SP9500X_RFU_V9_CHECK \
if (_v9 == nullptr) { \
    Log.set_last_err("Device:V9 disconnected"); \
    return -1; \
}

#define SP9500X_S6_CHECK \
if (_s6 == nullptr) { \
    Log.set_last_err("Device:S6 disconnected"); \
    return -1; \
}

// Register
#define SP9500X_RFU_V9_REG_DECL(addr) REG_DECL(ns_reg_sp9500x_rfu_v9,addr)
#define SP9500X_RFU_V9_REG_DATA(addr) REG_DATA(ns_reg_sp9500x_rfu_v9,addr)
#define SP9500X_RFU_V9_REG_CLER(addr) REG_CLER(ns_reg_sp9500x_rfu_v9,addr)
#define SP9500X_RFU_V9_REG(addr)      REG(ns_reg_sp9500x_rfu_v9,addr)

#define SP9500X_RFU_V9_REG_DECL_2(addr0,addr1) REG_DECL_2(ns_reg_sp9500x_rfu_v9,addr0,addr1)
#define SP9500X_RFU_V9_REG_DATA_2(addr0,addr1) REG_DATA_2(ns_reg_sp9500x_rfu_v9,addr0,addr1)
#define SP9500X_RFU_V9_REG_CLER_2(addr0,addr1) REG_CLER_2(ns_reg_sp9500x_rfu_v9,addr0,addr1)
#define SP9500X_RFU_V9_REG_2(addr0,addr1)      REG_2(ns_reg_sp9500x_rfu_v9,addr0,addr1)

#define SP9500X_S6_REG_DECL(addr) REG_DECL(ns_reg_sp9500x_s6,addr)
#define SP9500X_S6_REG_DATA(addr) REG_DATA(ns_reg_sp9500x_s6,addr)
#define SP9500X_S6_REG_CLER(addr) REG_CLER(ns_reg_sp9500x_s6,addr)
#define SP9500X_S6_REG(addr)      REG(ns_reg_sp9500x_s6,addr)

#define SP9500X_RRH_REG_DECL(addr) REG_DECL(ns_reg_sp9500x_rrh,addr)
#define SP9500X_RRH_REG_DATA(addr) REG_DATA(ns_reg_sp9500x_rrh,addr)
#define SP9500X_RRH_REG_CLER(addr) REG_CLER(ns_reg_sp9500x_rrh,addr)
#define SP9500X_RRH_REG(addr)      REG(ns_reg_sp9500x_rrh,addr)

#define SP1403_S6_REG_DECL(addr) REG_DECL(ns_reg_sp1403_s6,addr)
#define SP1403_S6_REG_DATA(addr) REG_DATA(ns_reg_sp1403_s6,addr)
#define SP1403_S6_REG_CLER(addr) REG_CLER(ns_reg_sp1403_s6,addr)
#define SP1403_S6_REG(addr)      REG(ns_reg_sp1403_s6,addr)

// IO
#define SP9500X_RFU_V9_W(addr) \
    SP9500X_RFU_V9_CHECK PCIE_DEV_W(_v9,pci_dev::AS_BAR0,ns_reg_sp9500x_rfu_v9,addr)

#define SP9500X_RFU_V9_R(addr) \
    SP9500X_RFU_V9_CHECK PCIE_DEV_R(_v9,pci_dev::AS_BAR0,ns_reg_sp9500x_rfu_v9,addr)

#define SP9500X_RFU_V9_W_2(addr0,addr1) \
    SP9500X_RFU_V9_CHECK PCIE_DEV_W_2(_v9,pci_dev::AS_BAR0,ns_reg_sp9500x_rfu_v9,addr0,addr1)

#define SP9500X_RFU_V9_R_2(addr0,addr1) \
    SP9500X_RFU_V9_CHECK PCIE_DEV_R_2(_v9,pci_dev::AS_BAR0,ns_reg_sp9500x_rfu_v9,addr0,addr1)

#define SP9500X_S6_W(addr) \
    SP9500X_S6_CHECK PCIE_DEV_W(_s6,pci_dev::AS_BAR0,ns_reg_sp9500x_s6,addr)

#define SP9500X_S6_R(addr) \
    SP9500X_S6_CHECK PCIE_DEV_R(_s6,pci_dev::AS_BAR0,ns_reg_sp9500x_s6,addr)

#define SP9500X_RFU_V9_SET_BITS(addr,bits,data) \
    PCIE_DEV_SET_BITS(SP9500X_RFU_V9,addr,bits,data)

#define SP9500X_RFU_V9_SET_BITS_2(addr0,addr1,bits,data) \
    PCIE_DEV_SET_BITS_2(SP9500X_RFU_V9,addr0,addr1,bits,data)

// Rising edge
#define SP9500X_RFU_V9_RE(addr,bit) CTRLLER_RE(SP9500X_RFU_V9,addr,bit)
#define SP9500X_RFU_V9_OP(addr) SP9500X_RFU_V9_RE(addr,op)

#define SP9500X_RFU_V9_RE_2(addr0,addr1,bit) CTRLLER_RE_2(SP9500X_RFU_V9,addr0,addr1,bit)
#define SP9500X_RFU_V9_OP_2(addr0,addr1) SP9500X_RFU_V9_RE_2(addr0,addr1,op)

#define SP9500X_S6_RE(addr,bit) CTRLLER_RE(SP9500X_S6,addr,bit)
#define SP9500X_S6_OP(addr) SP9500X_S6_RE(addr,op)

// State machine
#define SP9500X_RFU_V9_WAIT_IDLE(addr,flag,times) \
    CTRLLER_WAIT_IDLE(SP9500X_RFU_V9,addr,busy,flag,times)

#define SP9500X_RFU_V9_WAIT_IDLE_2(addr0,addr1,flag,times) \
    CTRLLER_WAIT_IDLE_2(SP9500X_RFU_V9,addr0,addr1,busy,flag,times)


// Register Define

namespace ns_reg_sp9500x_rfu_v9 {

REG_DEF_CPT_PREFIX_32(0x0000)
    unsigned op : 1;  // DMA state-machine reset signal
    unsigned rsv : 7;
    unsigned ver : 8; // firmware version
    unsigned cdw : 4;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x004c)
    unsigned slot_time : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x004d)
    unsigned ul : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x004e)
    unsigned dl : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c0)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c1)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c2)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c3)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c4)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c5)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c6)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c7)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c8)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00c9)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00ca)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00cb)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00cc)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00cd)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00ce)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00cf)
    unsigned cpri : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x00d0,0x00db)
    unsigned sr0 : 4;
    unsigned sr1 : 4;
    unsigned sr2 : 4;
    unsigned sr3 : 4;
    unsigned sr4 : 4;
    unsigned sr5 : 4;
    unsigned sr6 : 4;
    unsigned sr7 : 4;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x00d1,0x00dc)
    unsigned src0 : 4;
    unsigned src1 : 4;
    unsigned src2 : 4;
    unsigned src3 : 4;
    unsigned src4 : 4;
    unsigned src5 : 4;
    unsigned src6 : 4;
    unsigned src7 : 4;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32(0x00d2)
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_CPT_SUFFIX_32

