Andydingbing/SPC5/rd/chip/reg_def_sp9500x.h
REG_DEF_CPT_PREFIX_32(0x00d3)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00d4)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00d5)
    unsigned phase : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00d6)
    unsigned gain : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00f0)
    unsigned cpri0 : 8;
    unsigned cpri1 : 8;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00f1)
    unsigned src : 4;
    unsigned rsv0 : 28;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x00f2)
    unsigned sr : 4;
    unsigned rsv0 : 28;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x0103,0x0123)
    unsigned rrh : 1;
    unsigned pll : 1;
    unsigned sw : 1;
    unsigned att : 1;
    unsigned ch : 4;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0105,0x0125)
    unsigned addr : 7;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 1;
    unsigned busy : 1;
    unsigned rsv1 : 21;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0106,0x0126)
    unsigned data : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0107,0x0127)
    unsigned data : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0108,0x0128)
    unsigned data : 16;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned sync : 1;
    unsigned lock : 1;
    unsigned rsv0 : 1;
    unsigned busy : 1;
    unsigned rsv1 : 2;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0109,0x0129)
    unsigned data : 16;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned sync : 1;
    unsigned lock : 1;
    unsigned rsv0 : 1;
    unsigned busy : 1;
    unsigned rsv1 : 2;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x010a,0x012a)
    unsigned data : 16;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned sync : 1;
    unsigned lock : 1;
    unsigned rsv0 : 1;
    unsigned busy : 1;
    unsigned rsv1 : 2;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x010b,0x012b)
    unsigned data : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x010c,0x012c)
    unsigned data : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x010d,0x012d)
    unsigned data : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x010e,0x012e)
    unsigned data : 16;
    unsigned addr : 3;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 1;
    unsigned busy : 1;
    unsigned rsv1 : 9;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x010f,0x012f)
    unsigned data : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0110,0x0130)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 1;
    unsigned busy : 1;
    unsigned rsv1 : 12;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0111,0x0131)
    unsigned busy : 1;
    unsigned rsv0 : 1;
    unsigned rb  : 1;
    unsigned seq : 2;
    unsigned ref : 3;
    unsigned bw : 1;
    unsigned in : 3;
    unsigned incc : 3;
    unsigned cfg : 1;
    unsigned rsv1 : 15;
    unsigned op : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0112,0x0132)
    unsigned ad : 14;
    unsigned rsv0 : 18;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0113,0x0133)
    unsigned busy : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0114,0x0134)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0115,0x0135)
    unsigned det : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0117,0x0137)
    unsigned busy : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0180,0x01a0)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0181,0x01a1)
    unsigned cnt : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0182,0x01a2)
    unsigned n : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0183,0x01a3)
    unsigned addr_low : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0184,0x01a5)
    unsigned addr_high : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0185,0x01a6)
    unsigned length : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32(0x0186)
    unsigned addr_low : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0187)
    unsigned addr_high : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0188)
    unsigned length : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x0189,0x01a7)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x018a,0x01a8)
    unsigned length : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x018b,0x01a9)
    unsigned addr_low : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x018c,0x01aa)
    unsigned addr_high : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x018d,0x01ab)
    unsigned byte : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32(0x018e)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x018f)
    unsigned length : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0190)
    unsigned addr_low : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0191)
    unsigned addr_high : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0192)
    unsigned byte : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0240)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0241)
    unsigned abort : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x0242,0x0262)
    unsigned mode : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0243,0x0263)
    unsigned trig_src : 7;
    unsigned rsv0 : 25;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0244,0x0264)
    unsigned trig_edge : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0245,0x0265)
    unsigned threshold : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0246,0x0266)
    unsigned trig_offset : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0247,0x0267)
    unsigned time : 31;
    unsigned timeout : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0248,0x0268)
    unsigned trig_gap : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0249,0x0269)
    unsigned sr : 4;
    unsigned rsv0 : 28;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x024a,0x026a)
    unsigned frame : 10;
    unsigned rsv0 : 22;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x024b,0x026b)
    unsigned x : 10;
    unsigned rsv0 : 22;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x024c,0x026c)
    unsigned y : 10;
    unsigned rsv0 : 22;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x024d,0x026d)
    unsigned addr_low : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x024e,0x026e)
    unsigned addr_high : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x024f,0x026f)
    unsigned samples : 32;
REG_DEF_CPT_SUFFIX_32_2

