Andydingbing/SPC5/rd/chip/reg_def_sp9500x.h
REG_DEF_CPT_PREFIX_32_2(0x0250,0x0270)
    unsigned offset : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32(0x0260)
    unsigned start : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0261)
    unsigned abort : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0280)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0281)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0282)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0283)
    unsigned retrig : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0284)
    unsigned rep : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0285)
    unsigned trig_src : 3;
    unsigned rsv0 : 29;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0286)
    unsigned trig_edge : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0287)
    unsigned rep : 2;
    unsigned rsv0 : 30;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0288)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0289)
    unsigned next_seg : 6;
    unsigned rsv0 : 26;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x028a)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x028b)
    unsigned seg : 6;
    unsigned rsv0 : 26;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x028c)
    unsigned samples : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x028d)
    unsigned addr_low : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x028e)
    unsigned addr_high : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x028f)
    unsigned cycle : 12;
    unsigned rsv0 : 20;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0290)
    unsigned samples : 17;
    unsigned rsv0 : 15;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0291)
    unsigned segs : 6;
    unsigned rsv0 : 26;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0292)
    unsigned sr : 4;
    unsigned rsv0 : 28;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x0400,0x0200)
    unsigned bypass_lpf : 8;
    unsigned bypass_hbf0 : 8;
    unsigned bypass_hbf1 : 8;
    unsigned bypass_rc : 1; // rate conversion filters
    unsigned bypass_cf : 1; // compensate filter
    unsigned bypass_gc : 1; // gain compensate
    unsigned rsv0 : 5;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0401,0x04c1)
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0402,0x0202)
    unsigned op : 8;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0403,0x0203)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0405,0x0205)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0407,0x0207)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0409,0x0209)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x040b,0x020b)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x040d,0x020d)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x040f,0x020f)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0411,0x0211)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0413,0x0213)
    unsigned op0 : 1;
    unsigned op1 : 1;
    unsigned rsv0 : 30;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0414,0x0214)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0415,0x0215)
    unsigned phase : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0416,0x0216)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0417,0x0217)
    unsigned phase : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0418,0x0218)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0419,0x0219)
    unsigned phase : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x041a,0x021a)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x041b,0x021b)
    unsigned phase : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x042d,0x022d)
    unsigned src : 4;
    unsigned rsv0 : 28;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x042e,0x022e)
    unsigned ch : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32(0x0301)
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0302)
    unsigned op : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0313)
    unsigned op : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x041c,0x021c)
    unsigned op : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x041d,0x021d)
    unsigned tap : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x041e,0x021e)
    unsigned idx : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x041f,0x021f)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0420,0x0220)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0421,0x0221)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0422,0x0222)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0423,0x0223)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0424,0x0224)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0425,0x0225)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0426,0x0226)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0427,0x0227)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

