Andydingbing/SPC5/rd/chip/reg_def_sp9500x.h
REG_DEF_CPT_PREFIX_32_2(0x0428,0x04e8)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x0429,0x04e9)
    unsigned tap : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x042a,0x04ea)
    unsigned idx : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x042b,0x04eb)
    unsigned real : 16;
    unsigned imag : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x042c,0x04ec)
    unsigned real : 16;
    unsigned imag : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32(0x0440)
    unsigned reset_dl : 1;
    unsigned reset_ul : 1;
    unsigned rsv0 : 30;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0441)
    unsigned en_dl : 1;
    unsigned en_ul : 1;
    unsigned rsv0 : 30;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0443)
    unsigned sync : 2;
    unsigned rsv0 : 30;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0444)
    unsigned unsync_cnt_dl : 16;
    unsigned unsync_cnt_ul : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0445)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0450)
    unsigned src0 : 4;
    unsigned src1 : 4;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0451)
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0452)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0453)
    unsigned mode : 3;
    unsigned rsv0 : 29;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0454)
    unsigned period : 3;
    unsigned rsv0 : 29;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0455)
    unsigned interval : 3;
    unsigned rsv0 : 29;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0456)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0457)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0459)
    unsigned gain : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0462)
    unsigned tx_0 : 1;
    unsigned tx_1 : 1;
    unsigned rx_0 : 1;
    unsigned rx_1 : 1;
    unsigned rsv0 : 28;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0470)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0471)
    unsigned rx_0 : 1;
    unsigned rx_1 : 1;
    unsigned tx_0 : 1;
    unsigned tx_1 : 1;
    unsigned rsv0 : 28;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0472)
    unsigned iq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0480)
    unsigned mode : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0481)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0482)
    unsigned speed : 8;
    unsigned reg : 8;
    unsigned wr : 1;
    unsigned id : 7;
    unsigned rsv0 : 8;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0485)
    unsigned mode : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0486)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0487)
    unsigned speed : 8;
    unsigned reg : 8;
    unsigned wr : 1;
    unsigned id : 7;
    unsigned rsv0 : 8;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0800)
    unsigned bypass_lpf : 8;
    unsigned bypass_hbf2 : 8;
    unsigned bypass_hbf1 : 8;
    unsigned bypass_cf : 1;
    unsigned bypass_gc : 1;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0801)
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0802)
    unsigned op : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0803)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0805)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0807)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0809)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x080b)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x080d)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x080f)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0811)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0813)
    unsigned op0 : 1;
    unsigned op1 : 1;
    unsigned rsv0 : 30;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0814)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0815)
    unsigned phase : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0816)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0817)
    unsigned phase : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0818)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0819)
    unsigned phase : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x081a)
    unsigned freq : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x081b)
    unsigned phase : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x081c)
    unsigned op : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x081d)
    unsigned tap : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x081e)
    unsigned idx : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x081f)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0820)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0821)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0822)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0823)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0824)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0825)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

