Andydingbing/SPC5/rd/chip/reg_def_sp9500x.h
REG_DEF_CPT_PREFIX_32(0x0826)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0827)
    unsigned coef : 16;
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0828)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0829)
    unsigned tap : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x082a)
    unsigned idx : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x082b)
    unsigned real : 16;
    unsigned imag : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x082c)
    unsigned real : 16;
    unsigned imag : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x082d)
    unsigned src : 4;
    unsigned rsv0 : 28;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x082e)
    unsigned ch : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0840)
    unsigned mode : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0841)
    unsigned data : 8;
    unsigned addr : 15;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 1;
    unsigned busy : 1;
    unsigned rsv1 : 5;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0842)
    unsigned data : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1030)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1031)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1032)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1033)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1034)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1035)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1036)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1037)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1038)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x1039)
    unsigned data : 8;
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned rsv0 : 2;
    unsigned busy : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x103a)
    unsigned ch : 4;
    unsigned rsv0 : 28;
REG_DEF_CPT_SUFFIX_32

} // namespace ns_reg_sp9500x_rfu_v9


namespace ns_reg_sp9500x_rrh {

REG_DEF_CPT_PREFIX_32(0x03)
    unsigned rx_ref : 15;
    unsigned rx_ref_sign : 1;
    unsigned tx_pwr : 15;
    unsigned tx_pwr_sign : 1;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x07)
    unsigned det : 16;
    unsigned if_loop : 1;
    unsigned state : 1;
    unsigned sw : 2;
    unsigned rsv0 : 12;
REG_DEF_CPT_SUFFIX_32

} // ns_reg_sp9500x_rrh


namespace ns_reg_sp1403_s6 {

REG_DEF_CPT_PREFIX_16(0x1)
    unsigned tx0_sw1 : 1;
    unsigned tx0_sw2 : 1;
    unsigned tx0_sw3 : 1;
    unsigned tx0_sw4 : 1;
    unsigned tx0_sw5 : 1;
    unsigned tx0_sw6 : 1;
    unsigned tx0_sw7 : 1;
    unsigned tx0_sw8 : 1;
    unsigned tx0_sw9 : 1;
    unsigned tx0_sw10 : 1;
    unsigned tx0_sw11 : 1;
    unsigned tx0_sw12 : 1;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x2)
    unsigned tx1_sw1 : 1;
    unsigned tx1_sw2 : 1;
    unsigned tx1_sw3 : 1;
    unsigned tx1_sw4 : 1;
    unsigned tx1_sw5 : 1;
    unsigned tx1_sw6 : 1;
    unsigned rsv0 : 10;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x3)
    unsigned rx_sw1 : 1;
    unsigned rx_sw2 : 1;
    unsigned rx_sw3 : 1;
    unsigned rx_sw4 : 1;
    unsigned rx_sw5 : 1;
    unsigned rx_sw6 : 1;
    unsigned rx_sw7 : 1;
    unsigned rsv0 : 9;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x4)
    unsigned lo_sw1 : 1;
    unsigned lo_sw2 : 1;
    unsigned det_sw : 1;
    unsigned rsv0 : 13;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x5)
    unsigned tx0_red : 1;
    unsigned tx0_green : 1;
    unsigned rsv0 : 2;
    unsigned tx1_red : 1;
    unsigned tx1_green : 1;
    unsigned rsv1 : 2;
    unsigned rx_red : 1;
    unsigned rx_green : 1;
    unsigned rsv2 : 6;
REG_DEF_CPT_SUFFIX_16

} // namespace ns_reg_sp1403_s6


namespace ns_reg_sp9500x_s6 {

REG_DEF_CPT_PREFIX_32(0x0000)
    unsigned ver : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0002)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0004)
    unsigned op : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0100)
    unsigned buf : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0200)
    unsigned buf : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0101)
    unsigned program : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0102)
    unsigned mode : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0103)
    unsigned fpga : 2;
    unsigned rsv0 : 30;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0104)
    unsigned cfg_init_0 : 1;
    unsigned cfg_done_0 : 1;
    unsigned fifo_prog_full_0 : 1;
    unsigned fifo_prog_empty_0 : 1;
    unsigned rsv0 : 12;
    unsigned cfg_init_1 : 1;
    unsigned cfg_done_1 : 1;
    unsigned fifo_prog_full_1 : 1;
    unsigned fifo_prog_empty_1 : 1;
    unsigned rsv1 : 12;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0120)
    unsigned cfg_done : 1;
    unsigned rsv0 : 31;
REG_DEF_CPT_SUFFIX_32

} // namespace ns_reg_sp9500x_s6

#endif // REG_DEF_SP9500X_H
